trol73/avr-make/asm/include/ATxmega32D3def.inc
.equ OSC_OSCF_voffset = 0

; PORTC interrupt vector offsets

.equ PORTC_INT0_voffset = 0
.equ PORTC_INT1_voffset = 2

; PORTR interrupt vector offsets

.equ PORTR_INT0_voffset = 0
.equ PORTR_INT1_voffset = 2

; RTC interrupt vector offsets

.equ RTC_OVF_voffset = 0
.equ RTC_COMP_voffset = 2

; TWIC interrupt vector offsets

.equ TWIC_TWIS_voffset = 0
.equ TWIC_TWIM_voffset = 2

; TCC0 interrupt vector offsets

.equ TCC0_OVF_voffset = 0
.equ TCC0_ERR_voffset = 2
.equ TCC0_CCA_voffset = 4
.equ TCC0_CCB_voffset = 6
.equ TCC0_CCC_voffset = 8
.equ TCC0_CCD_voffset = 10

; TCC1 interrupt vector offsets

.equ TCC1_OVF_voffset = 0
.equ TCC1_ERR_voffset = 2
.equ TCC1_CCA_voffset = 4
.equ TCC1_CCB_voffset = 6

; SPIC interrupt vector offsets

.equ SPIC_INT_voffset = 0

; USARTC0 interrupt vector offsets

.equ USARTC0_RXC_voffset = 0
.equ USARTC0_DRE_voffset = 2
.equ USARTC0_TXC_voffset = 4

; NVM interrupt vector offsets

.equ NVM_EE_voffset = 0
.equ NVM_SPM_voffset = 2

; PORTB interrupt vector offsets

.equ PORTB_INT0_voffset = 0
.equ PORTB_INT1_voffset = 2

; PORTE interrupt vector offsets

.equ PORTE_INT0_voffset = 0
.equ PORTE_INT1_voffset = 2

; TWIE interrupt vector offsets

.equ TWIE_TWIS_voffset = 0
.equ TWIE_TWIM_voffset = 2

; TCE0 interrupt vector offsets

.equ TCE0_OVF_voffset = 0
.equ TCE0_ERR_voffset = 2
.equ TCE0_CCA_voffset = 4
.equ TCE0_CCB_voffset = 6
.equ TCE0_CCC_voffset = 8
.equ TCE0_CCD_voffset = 10

; USARTE0 interrupt vector offsets

.equ USARTE0_RXC_voffset = 0
.equ USARTE0_DRE_voffset = 2
.equ USARTE0_TXC_voffset = 4

; PORTD interrupt vector offsets

.equ PORTD_INT0_voffset = 0
.equ PORTD_INT1_voffset = 2

; PORTA interrupt vector offsets

.equ PORTA_INT0_voffset = 0
.equ PORTA_INT1_voffset = 2

; ACA interrupt vector offsets

.equ ACA_AC0_voffset = 0
.equ ACA_AC1_voffset = 2
.equ ACA_ACW_voffset = 4

; ADCA interrupt vector offsets

.equ ADCA_CH0_voffset = 0

; TCD0 interrupt vector offsets

.equ TCD0_OVF_voffset = 0
.equ TCD0_ERR_voffset = 2
.equ TCD0_CCA_voffset = 4
.equ TCD0_CCB_voffset = 6
.equ TCD0_CCC_voffset = 8
.equ TCD0_CCD_voffset = 10

; SPID interrupt vector offsets

.equ SPID_INT_voffset = 0

; USARTD0 interrupt vector offsets

.equ USARTD0_RXC_voffset = 0
.equ USARTD0_DRE_voffset = 2
.equ USARTD0_TXC_voffset = 4

; PORTF interrupt vector offsets

.equ PORTF_INT0_voffset = 0
.equ PORTF_INT1_voffset = 2

; TCF0 interrupt vector offsets

.equ TCF0_OVF_voffset = 0
.equ TCF0_ERR_voffset = 2
.equ TCF0_CCA_voffset = 4
.equ TCF0_CCB_voffset = 6
.equ TCF0_CCC_voffset = 8
.equ TCF0_CCD_voffset = 10



.equ INT_VECTORS_SIZE = 228 ; size in words


#endif /* _ATXMEGA32D3DEF_INC_ */

; ***** END OF FILE ******************************************************



